app/controllers/projects_controller.rb

SELECT `dat_projects`.* FROM `dat_projects` INNER JOIN `dat_projectusers` ON `dat_projects`.id = `dat_projectusers`.project_id WHERE ((`dat_projectusers`.user_id = 1) AND (valid_flg = 1 AND dat_projectusers.active_flg = 1))
---
  def index
    opt = {
     :include    => [{:dat_projectusers=>:user}],
     :conditions => ["dat_projects.valid_flg = 1 AND dat_projects.id in (SELECT pu.project_id FROM dat_projectusers pu WHERE pu.user_id = ? ) ", @current_user.id],
     :order      => "dat_projects.start_date desc, delivery_date desc"
    }
    @projects = DatProject.find(:all, opt)
    @active_project_ids = @active_projects.map {|p| p.id}

    if params[:id] && params[:active_flg]

    	project      = DatProject.find_project_and_users(params[:id],@current_user.id)

SELECT * FROM `dat_projects` WHERE ( dat_projects.project_cd='prehkey' ) LIMIT 1
SELECT * FROM `mst_users` WHERE (`mst_users`.`id` = 1) LIMIT 1
SELECT `dat_projectusers`.* FROM `dat_projectusers` WHERE (`dat_projectusers`.project_id = 1)
---
  def edit

    unless params[:id].nil?
      # 登録済みのプロジェクトオブジェクト取得
      p_cd = params[:id]
      opt = {
        :conditions => [" dat_projects.project_cd=? ", p_cd],
        :include    => :dat_projectusers
      }
      @project = DatProject.find(:first, opt)
      # 参加ユーザーが登録されていない場合、新規生成
      @project.dat_projectusers.build if @project.dat_projectusers.size == 0

INSERT INTO `dat_projects` (`start_date`, `create_user_id`, `created_on`, `delivery_date`, `updated_on`, `end_user_name`, `project_name`, `project_cd`, `update_user_id`, `valid_flg`) VALUES('2011-03-01', 1, '2011-03-08 07:45:29', '2011-04-05', '2011-03-08 07:45:29', 'Ian', 'prehkey', 'prehkey', 1, 1)
SELECT * FROM `mst_users` WHERE (`mst_users`.`id` = 1) LIMIT 1
INSERT INTO `dat_projectusers` (`create_user_id`, `created_on`, `project_id`, `user_id`, `active_flg`, `email`) VALUES(1, '2011-03-08 07:45:29', 1, 1, 1, 'lyslim@gmail.com')
---
  def create
    # プロジェクトオブジェクト生成
    # フォームパラメータから新規プロジェクトオブジェクトを生成
    project = DatProject.new(params[:project])
    project.create_user_id = current_user.id
    project.update_user_id = current_user.id

    #-----------------------------
    # 参加ユーザー生成
    #-----------------------------
    # 登録者自身もプロジェクトユーザーとして生成
    if ! current_user.id.nil?
      user = User.find(current_user.id)
      projectuser = project.dat_projectusers.build()
      projectuser.email = user.email
      projectuser.user_id = user.id
      projectuser.create_user_id = project.create_user_id

SELECT * FROM `mst_templates` WHERE ( mst_templates.id='2' ) LIMIT 1
SELECT `mst_compositions`.* FROM `mst_compositions` WHERE (`mst_compositions`.template_id = 2)
SELECT `mst_tpevents`.* FROM `mst_tpevents` WHERE (`mst_tpevents`.template_tree_id IN (17,18,19,20,21,22,23,24,25,26,27,28,29))
SELECT `mst_tpmilestones`.* FROM `mst_tpmilestones` WHERE (`mst_tpmilestones`.template_tree_id IN (17,18,19,20,21,22,23,24,25,26,27,28,29))
SELECT `mst_tptasks`.* FROM `mst_tptasks` WHERE (`mst_tptasks`.template_tree_id IN (17,18,19,20,21,22,23,24,25,26,27,28,29))
---
    #-----------------------------
    # テンプレートデータから、プロジェクトを構成
    #-----------------------------
    if ! params[:template][:id].nil? && ! params[:template][:id].empty?
      # 選択されたテンプレートデータを取得
      template = MstTemplate.find(:first,
                                  :conditions=>[" mst_templates.id=? ", params[:template][:id]],
                                  :include=>[{:mst_compositions=>[:mst_tptask, :mst_tpmilestone, :mst_tpevent]}])

SELECT * FROM `dat_projects` WHERE ( dat_projects.id='1' ) LIMIT 1
SELECT * FROM `mst_users` WHERE (`mst_users`.`id` = 1) LIMIT 1
SELECT `dat_projects`.* FROM `dat_projects` INNER JOIN `dat_projectusers` ON `dat_projects`.id = `dat_projectusers`.project_id WHERE ((`dat_projectusers`.user_id = 1) AND (valid_flg = 1 AND dat_projectusers.active_flg = 1))
SELECT `dat_projectusers`.* FROM `dat_projectusers` WHERE (`dat_projectusers`.project_id = 1)
INSERT INTO `dat_projectusers` (`create_user_id`, `created_on`, `project_id`, `user_id`, `active_flg`, `email`) VALUES(1, '2011-03-08 07:54:28', 1, 2, 1, 'l.yslim@gmail.com')
SELECT * FROM `mst_users` WHERE (`mst_users`.`email` = 'l.yslim@gmail.com') LIMIT 1
---
  def update
    if params[:project][:id].nil? || params[:project][:id].empty?
      # IDが指定されていない場合、エラー処理
      # ????? エラー処理 ?????
    else
      #-----------------------------
      # 登録済みのプロジェクトデータを取得
      #-----------------------------
      id = params[:project][:id]
      project = DatProject.find(:first,
                                :conditions=>[" dat_projects.id=? ", id],
                                :include=>:dat_projectusers)

      project.update_user_id = current_user.id

      #-----------------------------
      # 参加ユーザー生成
      #-----------------------------
      projectusers = Array.new
      project.dat_projectusers.each do |puser|
        projectusers.push puser.email
      end

      # 参加ユーザー指定時、プロジェクトユーザーオブジェクトを生成
      for user in params[:users]
        next if user.empty?