app/controllers/projectcomps_controller.rb

SELECT * FROM `dat_projectcomps` WHERE ( project_id=1 AND line_no < 1) ORDER BY line_no desc LIMIT 1
SELECT `dat_projects`.* FROM `dat_projects` INNER JOIN `dat_projectusers` ON `dat_projects`.id = `dat_projectusers`.project_id WHERE ((`dat_projectusers`.user_id = 1) AND (valid_flg = 1 AND dat_projectusers.active_flg = 1))
---
  def item_order_update

    id = params[:id]
    offset = params[:offset]

    return unless my_item?(params[:id])# check permission

    # retrieve target
    target = DatProjectcomp.find(id)

    # replace
    if offset.to_i > 0
      replacement = DatProjectcomp.find(:first,
                                        :conditions=>[" project_id=? AND line_no > ?", target.project_id, target.line_no],
                                        :order=>"line_no asc"
                                        )