app/controllers/tasks_controller.rb

  def update
    session_user_id = current_user.id

    return unless my_item?(params[:dlg_tsk_edit_comp][:id])# check permission

    #-----------------------------
    # Get registered object
    #-----------------------------
    @projectcomp = DatProjectcomp.find(:first,
                          :conditions => [" dat_projectcomps.id = ? ", params[:dlg_tsk_edit_comp][:id]],
                          :include =>[{:dat_task=>[:dat_taskusers]}] )
    @projectcomp.update_user_id = session_user_id
    @projectcomp.last_operation_kbn = 3
    @task = @projectcomp.dat_task
    @task.update_user_id = session_user_id
    @task.last_operation_kbn = 3

    #-----------------------------
    # task user generation
    #-----------------------------
    @task.dat_taskusers.clear
    if ! params[:dlg_tsk_edit_taskusers].nil?
      for puser in params[:dlg_tsk_edit_taskusers][:projectuser_id]
        taskuser = @task.dat_taskusers.build(:projectuser_id=>puser)
        taskuser.create_user_id = session_user_id
---
SELECT * FROM `dat_projectcomps` WHERE ( dat_projectcomps.id = '1' ) LIMIT 1
SELECT * FROM `mst_users` WHERE (`mst_users`.`id` = 1) LIMIT 1
SELECT `dat_tasks`.* FROM `dat_tasks` WHERE (`dat_tasks`.project_tree_id = 1)
SELECT `dat_taskusers`.* FROM `dat_taskusers` WHERE (`dat_taskusers`.task_id = 1)
UPDATE `dat_projectcomps` SET `last_operation_kbn` = 3, `updated_on` = '2011-03-08 08:18:07' WHERE `id` = 1
UPDATE `dat_tasks` SET `last_operation_kbn` = 3, `start_date` = '2011-03-08', `end_date` = '2011-03-15', `complete_date` = '2011-04-05', `main_user_id` = 2, `result` = '', `client_user_id` = 1, `updated_on` = '2011-03-08 08:18:07' WHERE `id` = 1
INSERT INTO `dat_taskusers` (`task_id`, `create_user_id`, `projectuser_id`, `created_on`) VALUES(1, 1, 2, '2011-03-08 08:18:07')